var questions = [
    {
        "question":"你會把自己比喻成哪種花香？",
        "answers":[
            ["濃郁的花香",2],
            ["清淡的花香",3]
            
        ]
    },
    {
        "question":"你會選擇哪種香味的潤唇膏？",
        "answers":[
            
            ["水果味",4],
            ["薄荷味",5]
        ]
    },
    {
        "question":"你會把自己比喻為哪種花束？",
        "answers":[
            ["紅色系的花束(如紅色/粉紅色/橙色)",7],
            ["非紅色系的花束(如白色/藍色/紫色)",5]
           
        ]
    },
    {
        "question":"你跟意中人首次約會用什麼香水？",
        "answers":[
            ["帶有甜味的花香",6],
            ["清爽的水果香味",7]
        ]
    },
    {
        "question":"你較喜歡哪種味道？",
        "answers":[
            ["盛夏乾燥的草味",9],
            ["雨後濕淋淋的草味",7]
           
        ]
    },
    {
        "question":"你覺得自己的愛情一直是比較不一般的？",
        "answers":[
            ["玫瑰",8],
            ["百合",9]
            
        ]
    },
    {
        "question":"你剛發現一瓶新款洗頭水，你十分喜歡它的味道，那瓶子的形狀是怎樣？",
        "answers":[
            ["圓形",6],
            ["長身形",10]

            ]
                   
    },
    {
        "question":"當你情緒低落時，哪種味道最能撫慰你的心靈？",
        "answers":[
            ["花香",11],
            ["森林的味道",12]
            
        ]
    },
    {
        "question":"你在收視超高的劇集中看見一個香包，它是什麼顏色？",
        "answers":[
            ["紫色",10],
            ["紅色",12]
        ]
    },
    {
        "question":"市面剛推出了一種全新的香草味雪糕，你的看法是什麼？",
        "answers":[
            ["相當引人注意",9],
            ["不太引人注意",13]    
        ]
    },
    {
        "question":"下列哪種味道會勾起你懷念的感覺？",
        "answers":[
            ["麵包香味",14],
            ["大自然的味道",15]
        ]
    },
    
    {
        "question":"如果月亮的光輝會發出味道，你嗅到後會聯想起下列哪組形容詞？",
        "answers":[
            ["刺激/燦爛奪目/香味四溢",11],
            ["沉鬱/弧獨/踏實/安靜",15]
        ]
    },
    {
        "question":"你較喜歡哪種香味？",
        "answers":[
            ["香料",12],
            ["茶香",16]
        ]
    },
    {
        "question":"你對體味的看法是？",
        "answers":[
            ["非常討厭",19],
            ["如果是自己喜歡的味道就沒有關係",18]
        ]
    },
    {
        "question":"你覺得什麼香味較有助提神？",
        "answers":[
            ["柑橘香",19],
            ["薄荷香",18]
        ]
    },
    {
        "question":"你喜歡異性身上有哪種香味？",
        "answers":[
            ["香水味",20],
            ["自然肥皂",19]
        ]
    },
    {
        "question":"想起遊樂場，你會想起哪種味道？",
        "answers":[
            ["牛奶及葡萄",20],
            ["甜甜的糖果",21]
        ]
    },
    {
        "question":"如果要在房間燃點香薰，你喜歡哪一種形狀的香薰？",
        "answers":[
            ["三角錐形",20],
            ["棒狀",21]
        ]
    },
    {
        "question":"你對於香水的看法是？",
        "answers":[
            ["非常喜歡",18],
            ["不算十分喜歡",22]
        ]
    },
    {
        "question":"對於嬰兒使用的肥皂系列香味有什麼看法？",
        "answers":[
            ["喜歡","A"],
            ["不是特別喜歡","B"]
        ]
    },
    {
        "question":"你知道自己的味道嗎？",
        "answers":[
            ["不知道",20],
            ["知道","C"]
        ]
    },
    {
        "question":"喜歡皮革的味道嗎？",
        "answers":[
            ["喜歡",21],
            ["討厭","D"]
        ]
    }

    
];

var finalAnswers={
        "A":["你是屬於水果香形象你充滿自由愉悅的氣息，像個天真無邪的孩子。有你在的地方，整個氣氛都會興奮起來，所以你在朋友圈中是不可或缺的人物。雖說你個性開朗，受到大部份人的喜愛，但別人一般認為難以跟你成為親密好友，你給人的印像只是個搞笑能手。有些人覺得你愛玩弄別人，依賴性又強，所以不太願意親近你。不過，真正的你其實十分成熟穩重，正因透徹了解你的人不多，所以知己朋友也相當少。"],
        "B":["你是屬於東方花香形象你擁有強烈的自我意識及自己的世界，不會被他人玩弄於股掌之間，會利用自己的力量積極地達成願望，給人有熱情的印象。你不會跟朋友糾纏不清，再加上給人單獨行動的印象，圍繞在你周遭的人都會覺得你是​​一個「帶有神秘色彩的人物」。 「神秘感」有時是相當有魅力的意思，但是人們對於你嚴密的防備以及自命清高的態度，感覺無法輕鬆地與你對談而覺得你難以應付。甚而變成非必要不跟你接觸，對你敬而遠之的傾向。真正的你其實是相當溫柔的，但是除非是與你相當親近的人，否則是無法注意到你的優點。"],
        "C":["你是屬於草香形象你擁有非常堅強的意志，不依賴他人，給人獨來獨往的印象。你擁有旺盛的好奇心與豐富的感受性，是個過著知性生活的現代人。驟看下你是個自命清高，不好相處的人，但是一旦跟你交談後，就知道你很好相處，等到交情加深之後，就更知道你其實擁有很爽快的個性。你所擁有的中性化魅力，讓你不論在男性團體或女性團體都大受歡迎，不過你不喜歡讓人看到你脆弱的一面。你外表上看來也許很冷靜，但實際上卻是熱情如火。能夠知道你真正本性的人，才能夠跟你天長地久地交往下去。"],
        "D":["你是屬於花香形象你總是給人樂觀、積極和勇於面對困難的感覺，而且溫柔優雅，很懂得為他人設想，給人非常擅長維繫人際關係的印象。這樣的你讓人感到既堅強又脆弱，尤其是你那關懷體貼的包容力，更讓人覺得你相當有魅力，很值得信賴。你長期給人認為你是個「拜託做事絕不會拒絕」的人，所以特別容易讓依賴心強、只顧自己利益的人利用。這些人因為看中你細心隨和的一面，所以會故意親近你，然後藉故佔你便宜"]
};


